In [2]:
import pandas as pd
from sqlalchemy import create_engine

In [20]:
sqlitedb_path = '../data/raw/veronicamg.db'

In [21]:
engine = create_engine(f'sqlite:///{sqlitedb_path}')

In [22]:
engine.table_names()

['business_info', 'personal_info', 'rank_info']

In [25]:
df_business_info = pd.read_sql_query("select * from business_info", engine)

df_business_info.head()

,id,Unnamed: 0,Source,worth,worthChange,realTimeWorth,realTimePosition
0,1014,52,Technology ==> Amazon,112.0 BUSD,0.0 millions USD,None,1
1,1305,53,Technology ==> Microsoft,90.0 BUSD,-0.001 millions USD,None,2
2,3988,54,Finance and Investments ==> Berkshire Hathaway,84.0 BUSD,-0.002 millions USD,None,3
3,9380,55,Fashion & Retail ==> LVMH,72.0 BUSD,0.0 millions USD,None,4
4,4001,56,Technology ==> Facebook,71.0 BUSD,0.0 millions USD,None,5

In [29]:
df_business_info.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2208 entries, 0 to 2207
Data columns (total 7 columns):
id                  2208 non-null int64
Unnamed: 0          2208 non-null int64
Source              2208 non-null object
worth               2208 non-null object
worthChange         2208 non-null object
realTimeWorth       0 non-null object
realTimePosition    2208 non-null int64
dtypes: int64(3), object(4)
memory usage: 120.9+ KB

In [30]:
df_business_info.isnull().sum()

id                     0
Unnamed: 0             0
Source                 0
worth                  0
worthChange            0
realTimeWorth       2208
realTimePosition       0
dtype: int64

In [53]:
df_business_info_2 = df_business_info[['id','Unnamed: 0','Source','worth','worthChange','realTimePosition']]

In [26]:
df_personal_info = pd.read_sql_query("select * from personal_info", engine)

df_personal_info.head()

,id,lastName,age,Unnamed: 0,gender,country,image
0,1014,bEZOs,54 years old,52,None,United States,https://specials-images.forbesimg.com/imageser...
1,1305,gaTEs,62 years old,53,Male,USA,https://specials-images.forbesimg.com/imageser...
2,3988,bufFETt,87 years old,54,M,United States,https://specials-images.forbesimg.com/imageser...
3,9380,aRNAUlt,69 years old,55,None,None,https://specials-images.forbesimg.com/imageser...
4,4001,zucKERBERg,1985,56,M,United States,https://specials-images.forbesimg.com/imageser...

In [54]:
df_personal_info.isnull().sum()

id             0
lastName       0
age           65
Unnamed: 0     0
gender        13
country        0
image          0
dtype: int64

In [27]:
df_rank_info = pd.read_sql_query("select * from rank_info", engine)

df_rank_info.head()

     id                         name  position  Unnamed: 0
0  9036  anant ASAVABHOKHIN & FAMILY       NaN           0
1  4048               aRASH FERdowsi       NaN           1
2  7384     banthoon LAMSAM & FAMILy       NaN           2
3  9738       bill adDERLEY & family       NaN           3
4  5623            boris zINGARevich       NaN           4

In [56]:
df_business_personal = pd.merge(df_business_info_2, df_personal_info, on='Unnamed: 0')
df_business_personal.head()

,id_x,Unnamed: 0,Source,worth,worthChange,realTimePosition,id_y,lastName,age,gender,country,image
0,1014,52,Technology ==> Amazon,112.0 BUSD,0.0 millions USD,1,1014,bEZOs,54 years old,None,United States,https://specials-images.forbesimg.com/imageser...
1,1305,53,Technology ==> Microsoft,90.0 BUSD,-0.001 millions USD,2,1305,gaTEs,62 years old,Male,USA,https://specials-images.forbesimg.com/imageser...
2,3988,54,Finance and Investments ==> Berkshire Hathaway,84.0 BUSD,-0.002 millions USD,3,3988,bufFETt,87 years old,M,United States,https://specials-images.forbesimg.com/imageser...
3,9380,55,Fashion & Retail ==> LVMH,72.0 BUSD,0.0 millions USD,4,9380,aRNAUlt,69 years old,None,None,https://specials-images.forbesimg.com/imageser...
4,4001,56,Technology ==> Facebook,71.0 BUSD,0.0 millions USD,5,4001,zucKERBERg,1985,M,United States,https://specials-images.forbesimg.com/imageser...

In [58]:
df_merged = pd.merge(df_business_personal, df_rank_info, on='Unnamed: 0')
df_merged.head()

,id_x,Unnamed: 0,Source,worth,worthChange,realTimePosition,id_y,lastName,age,gender,country,image,id,name,position
0,1014,52,Technology ==> Amazon,112.0 BUSD,0.0 millions USD,1,1014,bEZOs,54 years old,None,United States,https://specials-images.forbesimg.com/imageser...,1014,JEFF BEZOs,1.0
1,1305,53,Technology ==> Microsoft,90.0 BUSD,-0.001 millions USD,2,1305,gaTEs,62 years old,Male,USA,https://specials-images.forbesimg.com/imageser...,1305,bilL GAtes,2.0
2,3988,54,Finance and Investments ==> Berkshire Hathaway,84.0 BUSD,-0.002 millions USD,3,3988,bufFETt,87 years old,M,United States,https://specials-images.forbesimg.com/imageser...,3988,wARREN BUFFett,3.0
3,9380,55,Fashion & Retail ==> LVMH,72.0 BUSD,0.0 millions USD,4,9380,aRNAUlt,69 years old,None,None,https://specials-images.forbesimg.com/imageser...,9380,bERNARD ARnault,4.0
4,4001,56,Technology ==> Facebook,71.0 BUSD,0.0 millions USD,5,4001,zucKERBERg,1985,M,United States,https://specials-images.forbesimg.com/imageser...,4001,mark zUCKERBERG,5.0

In [59]:
df_merged.drop(columns=['id_x', 'id_y'], inplace = True)

        Unnamed: 0  realTimePosition           id     position
count  2208.000000       2208.000000  2208.000000  2208.000000
mean   1155.500000       1102.043478  5487.492301  1104.500000
std     637.539018        630.218047  2605.913561   637.539018
min      52.000000          1.000000  1000.000000     1.000000
25%     603.750000        555.750000  3258.750000   552.750000
50%    1155.500000       1106.500000  5433.500000  1104.500000
75%    1707.250000       1655.250000  7723.750000  1656.250000
max    2259.000000       2153.000000  9991.000000  2208.000000